benchmark-results/20260405-172151/01-plain-direct/raw.log
Json file /out/results.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 88120 secs]  0 threads 50 conns:    20000000 ops,  481244 (avg:     226) ops/sec, 19.94MB/sec (avg: 9.63KB/sec),  0.42 (avg: 65.17) msec latency

4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           20.63          ---          ---        10.77571         0.43100         2.33500         5.69500         1.59 
Gets          206.33         0.09       206.24        12.72771         0.43100         2.33500         5.50300         8.04 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        226.97         0.09       206.24        12.55025         0.43100         2.33500         5.50300         9.63 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.015        0.000
SET       0.103        5.000
SET       0.183       10.000
SET       0.231       15.000
SET       0.279       20.000
SET       0.319       25.000
SET       0.351       30.000
SET       0.375       35.000
SET       0.399       40.000
SET       0.415       45.000
SET       0.431       50.000
SET       0.439       52.500
SET       0.447       55.000
SET       0.463       57.500
SET       0.471       60.000
SET       0.479       62.500
SET       0.495       65.000
SET       0.511       67.500
SET       0.527       70.000
SET       0.543       72.500
SET       0.567       75.000
SET       0.583       76.250
SET       0.599       77.500
SET       0.615       78.750
SET       0.631       80.000
SET       0.647       81.250
SET       0.671       82.500
SET       0.687       83.750
SET       0.711       85.000
SET       0.743       86.250
SET       0.775       87.500
SET       0.791       88.125
SET       0.807       88.750
SET       0.831       89.375
SET       0.847       90.000
SET       0.879       90.625
SET       0.903       91.250
SET       0.927       91.875
SET       0.959       92.500
SET       0.999       93.125
SET       1.039       93.750
SET       1.063       94.062
SET       1.087       94.375
SET       1.119       94.688
SET       1.143       95.000
SET       1.175       95.312
SET       1.215       95.625
SET       1.255       95.938
SET       1.311       96.250
SET       1.367       96.562
SET       1.431       96.875
SET       1.471       97.031
SET       1.511       97.188
SET       1.551       97.344
SET       1.599       97.500
SET       1.655       97.656
SET       1.711       97.812
SET       1.767       97.969
SET       1.831       98.125
SET       1.895       98.281
SET       1.967       98.438
SET       1.999       98.516
SET       2.039       98.594
SET       2.079       98.672
SET       2.127       98.750
SET       2.191       98.828
SET       2.255       98.906
SET       2.319       98.984
SET       2.399       99.062
SET       2.495       99.141
SET       2.591       99.219
SET       2.639       99.258
SET       2.687       99.297
SET       2.751       99.336
SET       2.799       99.375
SET       2.879       99.414
SET       2.943       99.453
SET       3.007       99.492
SET       3.103       99.531
SET       3.199       99.570
SET       3.327       99.609
SET       3.391       99.629
SET       3.455       99.648
SET       3.551       99.668
SET       3.631       99.688
SET       3.727       99.707
SET       3.807       99.727
SET       3.887       99.746
SET       3.999       99.766
SET       4.095       99.785
SET       4.287       99.805
SET       4.383       99.814
SET       4.479       99.824
SET       4.575       99.834
SET       4.703       99.844
SET       4.831       99.854
SET       4.991       99.863
SET       5.119       99.873
SET       5.311       99.883
SET       5.535       99.893
SET       5.759       99.902
SET       5.919       99.907
SET       6.015       99.912
SET       6.143       99.917
SET       6.271       99.922
SET       6.463       99.927
SET       6.687       99.932
SET       6.879       99.937
SET       7.071       99.941
SET       7.423       99.946
SET       7.807       99.951
SET       7.999       99.954
SET       8.255       99.956
SET       8.575       99.958
SET       8.959       99.961
SET       9.215       99.963
SET       9.471       99.966
SET       9.791       99.968
SET      10.175       99.971
SET      10.431       99.973
SET      10.751       99.976
SET      11.135       99.977
SET      11.455       99.978
SET      11.711       99.979
SET      11.967       99.980
SET      12.223       99.982
SET      12.415       99.983
SET      12.735       99.984
SET      13.183       99.985
SET      14.847       99.987
SET      16.511       99.988
SET      17.279       99.988
SET      18.559       99.989
SET      19.071       99.990
SET      19.327       99.990
SET      19.583       99.991
SET      19.839       99.991
SET      20.095       99.992
SET      20.351       99.993
SET      20.479       99.993
SET      20.607       99.994
SET      20.735       99.994
SET      20.991       99.995
SET      21.631       99.995
SET      21.887       99.995
SET      22.143       99.995
SET      22.399       99.996
SET      23.167       99.996
SET      26.623       99.996
SET      29.567       99.997
SET      32.127       99.997
SET      33.279       99.997
SET      36.607       99.997
SET      37.887       99.997
SET      43.263       99.998
SET      45.823       99.998
SET      56.063       99.998
SET      60.415       99.998
SET      81.407       99.998
SET    603979.750       99.998
SET    603979.750      100.000
---
GET       0.015        0.000
GET       0.103        5.000
GET       0.183       10.000
GET       0.231       15.000
GET       0.279       20.000
GET       0.319       25.000
GET       0.351       30.000
GET       0.375       35.000
GET       0.391       40.000
GET       0.415       45.000
GET       0.431       50.000
GET       0.439       52.500
GET       0.447       55.000
GET       0.463       57.500
GET       0.471       60.000
GET       0.479       62.500
GET       0.495       65.000
GET       0.511       67.500
GET       0.527       70.000
GET       0.543       72.500
GET       0.567       75.000
GET       0.583       76.250
GET       0.599       77.500
GET       0.607       78.750
GET       0.631       80.000
GET       0.647       81.250
GET       0.671       82.500
GET       0.687       83.750
GET       0.711       85.000
GET       0.743       86.250
GET       0.775       87.500
GET       0.791       88.125
GET       0.807       88.750
GET       0.831       89.375
GET       0.847       90.000
GET       0.879       90.625
GET       0.903       91.250
GET       0.935       91.875
GET       0.967       92.500
GET       0.999       93.125
GET       1.039       93.750
GET       1.063       94.062
GET       1.087       94.375
GET       1.119       94.688
GET       1.151       95.000
GET       1.183       95.312
GET       1.223       95.625
GET       1.263       95.938
GET       1.311       96.250
GET       1.367       96.562
GET       1.439       96.875
GET       1.471       97.031
GET       1.511       97.188
GET       1.559       97.344
GET       1.607       97.500
GET       1.655       97.656
GET       1.711       97.812
GET       1.767       97.969
GET       1.831       98.125
GET       1.895       98.281
GET       1.967       98.438
GET       1.999       98.516
GET       2.039       98.594
GET       2.095       98.672
GET       2.143       98.750
GET       2.191       98.828
GET       2.255       98.906
GET       2.319       98.984
GET       2.399       99.062
GET       2.495       99.141
GET       2.591       99.219
GET       2.639       99.258
GET       2.687       99.297
GET       2.735       99.336
GET       2.799       99.375
GET       2.863       99.414
GET       2.927       99.453
GET       3.007       99.492
GET       3.087       99.531
GET       3.183       99.570
GET       3.311       99.609
GET       3.375       99.629
GET       3.455       99.648
GET       3.535       99.668
GET       3.615       99.688
GET       3.695       99.707
GET       3.791       99.727
GET       3.871       99.746
GET       3.967       99.766
GET       4.079       99.785
GET       4.223       99.805
GET       4.319       99.814
GET       4.415       99.824
GET       4.511       99.834
GET       4.639       99.844
GET       4.735       99.854
GET       4.863       99.863
GET       4.991       99.873
GET       5.151       99.883
GET       5.343       99.893
GET       5.535       99.902
GET       5.663       99.907
GET       5.823       99.912
GET       5.919       99.917
GET       6.079       99.922
GET       6.207       99.927
GET       6.399       99.932
GET       6.623       99.937
GET       6.847       99.941
GET       7.103       99.946
GET       7.423       99.951
GET       7.647       99.954
GET       7.839       99.956
GET       8.095       99.958
GET       8.319       99.961
GET       8.639       99.963
GET       9.023       99.966
GET       9.279       99.968
GET       9.535       99.971
GET       9.919       99.973
GET      10.367       99.976
GET      10.559       99.977
GET      10.815       99.978
GET      11.071       99.979
GET      11.263       99.980
GET      11.519       99.982
GET      11.775       99.983
GET      12.031       99.984
GET      12.287       99.985
GET      12.607       99.987
GET      12.799       99.988
GET      12.991       99.988
GET      13.183       99.989
GET      13.503       99.990
GET      14.015       99.990
GET      14.847       99.991
GET      15.551       99.991
GET      16.511       99.992
GET      17.791       99.993
GET      18.303       99.993
GET      19.199       99.994
GET      20.351       99.994
GET      22.143       99.995
GET      25.599       99.995
GET      26.367       99.995
GET      27.263       99.995
GET      29.183       99.996
GET      29.695       99.996
GET      30.591       99.996
GET      36.095       99.997
GET      38.655       99.997
GET      43.007       99.997
GET      45.823       99.997
GET      54.015       99.997
GET      57.343       99.998
GET      62.719       99.998
GET      81.407       99.998
GET    603979.750       99.998
GET    603979.750      100.000
---
WAIT      0.000      100.000
Saving JSON output file: /out/results.json
Json file closed.